chore: updated the docs to support everything else we changed
Signed-off-by: Kevin Carter <kevin.carter@rackspace.com>
